trunk/fireFoam/testBatteryFireFOAM/1DpyrolysisTest/0/p
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    outlet      
    {
        type            calculated;
        value           $internalField;
    }

    ground           
    {
        type            calculated;
        value           $internalField;
    }

    side          
    {
        type            calculated;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }

    region0_to_panelRegion_panel
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
