trunk/fireFoam/testBatteryFireFOAM/1DpyrolysisTest/0/T
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          T;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.15;

boundaryField
{
    outlet          
    {
	type		inletOutlet;
	inletValue	$internalField;
	value		$internalField;
    }

    ground           
    {
        type            zeroGradient;
    }

    side          
    {
	type		inletOutlet;
	inletValue	$internalField;
	value		$internalField;
    }

    frontAndBack    
    {
        type            empty;
    }
   
    region0_to_panelRegion_panel
    {
        type          compressible::fixedIncidentRadiationCoupledMixed;
        neighbourFieldName T;
        K               none;
        neighbourFieldRadiativeName none;
        fieldRadiativeName Qr;
        QrIncident      60000;
        value           $internalField;
    }
}


// ************************************************************************* //
