trunk/fireFoam/testBatteryFireFOAM/1DpyrolysisTest/0/panelRegion/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.15;

boundaryField
{
    panel_top
    {
        type            zeroGradient;
    }
    panel_side
    {
	type empty;
    }

   region0_to_panelRegion_panel
    {
        type          compressible::fixedIncidentRadiationCoupledMixed;
        neighbourFieldName T;
        K               K;
        neighbourFieldRadiativeName Qr;
        fieldRadiativeName none;
        QrIncident      60000.0;
        //epsilon      0.3;
        value           uniform 298.15;
    }

}


// ************************************************************************* //
